SOAP/resources/catalog/International_Phone_Code_Envelope.txt

<?xml version="1.0" encoding="utf-8"?>
<!--Envelope that encapsulates the provided data: sCountryISOCode specific to the international phone code request-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CountryIntPhoneCode xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>?</sCountryISOCode>
    </CountryIntPhoneCode>
  </soap:Body>
</soap:Envelope>