.metadata/.plugins/org.eclipse.core.resources/.history/fe/709e4c242ec5001a15f09b28feee9cd4

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CountryCurrency xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>IN</sCountryISOCode>
        </CountryCurrency>
    </Body>
</Envelope>