TestServicesSoap/src/test/resources/soap/filecodigoISOidioma.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
    <soapenv:Header/>
    <soapenv:Body>
        <web:LanguageISOCode>
            <web:sLanguageName>%s</web:sLanguageName>
        </web:LanguageISOCode>
    </soapenv:Body>
</soapenv:Envelope>