DEMOAPIProject/PractiseFiles/DemoPhoneCode.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CountryIntPhoneCode xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>IN</sCountryISOCode>
        </CountryIntPhoneCode>
    </Body>
</Envelope>