TestServicesSoap/src/test/resources/soap/filecodigoISObandera.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
    <soapenv:Header/>
    <soapenv:Body>
        <web:CountryFlag>
            <web:sCountryISOCode>%s</web:sCountryISOCode>
        </web:CountryFlag>
    </soapenv:Body>
</soapenv:Envelope>