.metadata/.plugins/org.eclipse.core.resources/.history/7d/90e46142e1c8001a1586a9901b37332e

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CountryISOCode xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryName>India</sCountryName>
        </CountryISOCode>
    </Body>
</Envelope>