QualitasDigitalSoapAPITestSampleCSharp/src/TestData/SoapTestDataCountryPhoneCode.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<CountryIntPhoneCode xmlns="http://www.oorsprong.org/websamples.countryinfo">
			<sCountryISOCode>US</sCountryISOCode>
		</CountryIntPhoneCode>
	</soap:Body>
</soap:Envelope>