TestServicesSoap/src/test/resources/soap/filecurrencyofacountry.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <CountryCurrency xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>%s</sCountryISOCode>
        </CountryCurrency>
    </soap:Body>
</soap:Envelope>