src/test/resources/files/countryisocode/contryisocode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
    <soapenv:Header/>
    <soapenv:Body>
        <web:CountryISOCode>
            <web:sCountryName>%s</web:sCountryName>
        </web:CountryISOCode>
    </soapenv:Body>
</soapenv:Envelope>