src/test/resources/files/countryname/countryname.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
    <soapenv:Header/>
    <soapenv:Body>
        <web:CountryName>
            <web:sCountryISOCode>%s</web:sCountryISOCode>
        </web:CountryName>
    </soapenv:Body>
</soapenv:Envelope>