src/test/resources/soap/filenombremoneda.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
    <soapenv:Header/>
    <soapenv:Body>
        <web:CurrencyName>
            <web:sCurrencyISOCode>%s</web:sCurrencyISOCode>
        </web:CurrencyName>
    </soapenv:Body>
</soapenv:Envelope>