Day2_MY_FRIST_SOAPSCRIPT_USING_WEB_SERVICES_PROTOCOL/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action></wsa:Action><wsa:MessageID>uuid:37b62f2a-f183-4028-be72-3631c7cbc592</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso</wsa:To></soap:Header><soap:Body><CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo"><sCountryISOCode>AUS</sCountryISOCode></CapitalCity></soap:Body></soap:Envelope>