assignment-4/invokeservice/src/main/resources/country.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
   <soapenv:Header/>
   <soapenv:Body>
      <web:CountryName>
         <web:sCountryISOCode>#{attributes.queryparam.isoCode}</web:sCountryISOCode>
      </web:CountryName>
   </soapenv:Body>
</soapenv:Envelope>