.metadata/.plugins/org.eclipse.core.resources/.history/5e/f05408b145c5001a15f09b28feee9cd4

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>{{countryISOCode}}</sCountryISOCode>
        </CapitalCity>
    </Body>
</Envelope>