RestAssuredProject/SOAPRequest/CountryName.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CountryName xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>USA</sCountryISOCode>
        </CountryName>
    </Body>
</Envelope>